Rezillien/STM32MIDI/Src/main.c
}


int8_t CDC_Receive_HS (uint8_t* Buf, uint32_t *Len)
{

     
  /* USER CODE BEGIN 6 */ // CDC_Receive_FS  is a callback function. When data were received, the system calls this function. The received data can be accessed via Buf,and *Len
    //s_RxBuffers.IsCommandDataReceived=1; //indicates data were received
    //s_RxBuffers.CommandsLens[s_RxBuffers.pos_receive]=*Len; //only set the length, data was directly saved to buffer
     
    //s_RxBuffers.pos_receive++;//move to next position to receive data  
    //if(s_RxBuffers.pos_receive>=MaxCommandsInBuffer) //reach the last buffer, need to rewind to 0
    //{
    //    s_RxBuffers.pos_receive=0;
    //}      
     
//prepare to receive the next data
    //USBD_CDC_SetRxBuffer(hUsbDevice_0, s_RxBuffers.UserRxBufferFS[s_RxBuffers.pos_receive]);//Set the buffer to receive incoming data
    //USBD_CDC_ReceivePacket(hUsbDevice_0);// Tell that you are ready to receive the next packet, otherwise you wouldn't be able to receive next data


    //printf("recived");
    MessageLength = sprintf(DataToSend, "recived\n", MessageCounter);
    CDC_Transmit_HS(DataToSend, MessageLength);
    //osDelay(1);
 
     return USBD_OK;
      
  /* USER CODE END 6 */
}

//////////////////////////////////////////////////
//////////////////////////////////////////////////
//////////////////////////////////////////////////
//////////////////////////////////////////////////
//////////////////////////////////////////////////
void setupBassGuitar(){
    //to robi gitare wuoncza
    char status_byte_instrument=0xC2;//MIDI channel 2
    char data_byte_1_instrument=0x21;//bass guitar

    MessageLength = sprintf(DataToSend, "%c%c",status_byte_instrument,data_byte_1_instrument);
    CDC_Transmit_HS(DataToSend, MessageLength);
}

char setupStatusByte(char keyStatus){
    if(keyStatus == 0){//note on
        return 0x92;
    }else if(keyStatus == 1){//note off
        return 0x82;
    }
}

char setupDataByte2(char row,char column){
    return 52 + column + 5*row;
}


/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_DEVICE */
  MX_USB_DEVICE_Init();



  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    setupBassGuitar();

    char keyStatus, row, column;
    //tukej dostaje char z kosmosu
    char c=0;
    while(c==0){
        c=readkey();
        osDelay(5);
    }
    char keyStatusMask = 0x40;
    char rowMask = 0x30;
    char columnMask = 0xF;
    
    keyStatus = c & keyStatusMask;
    row = c & rowMask;
    column = c & columnMask;

    char status_byte;
    char data_byte_1;
    char data_byte_2=0x40;//velocity=64

    status_byte = setupStatusByte(keyStatus);
    data_byte_1 = setupDataByte2(row, column);

    MessageLength = sprintf(DataToSend, "%c%c%c",status_byte,data_byte_1,data_byte_2);
    CDC_Transmit_HS(DataToSend, MessageLength);
    osDelay(500);

  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

static void print_chr(char chr)
{
    HAL_UART_Transmit(&huart1,
    (uint8_t*)&chr, 1, 1000);
}


ssize_t _write_r(struct _reent *r, int fd, const void *ptr, size_t len)
{
    int cntr = len;
    char *pTemp = (char*)ptr;
    while(cntr--)
        print_chr(*pTemp++);
    return len;
}

char readkey(void)
{
    uint8_t rxed;
    HAL_StatusTypeDef res =
        HAL_UART_Receive(&huart1,&rxed,1,1);


    if(res == HAL_OK)
        return rxed;
    else
        return 0;
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
